<?php
/**
 * job's name: grammar
 * job's description: Aratic's Emalaa
 *
 * @return new content to update, or null to cancel and skip
 *
* Statbility: not tested much - 50% stable
 */

 $JOBS_NAMES['grammar'] = 'تصحيح إملائي';


function grammar($content, $PAGE = null, $xvalues = null){

	//PAGE is page class handler

	$simple_replace = $regex_replace = array();

	$regex_replace['!(\w+) و (\w+)!u'] = '$1 و$2';# X و Y => X وY

	//taken from pywiki
	$words = array(
			 'إمرأة' => 'امرأة',
			'الى' => 'إلى',
			'إسم' => 'اسم',
			'الأن' => 'الآن',
			'الة' => 'آلة',
			'فى' => 'في',
			'إبن' => 'ابن',
			'إبنة' => 'ابنة',
			'إقتصاد' => 'اقتصاد',
			'إجتماع' => 'اجتماع',
			'انجيل' => 'إنجيل',
			'اجماع' => 'إجماع',
			'اكتوبر' => 'أكتوبر',
			'إستخراج' => 'استخراج',
			'إستعمال' => 'استعمال',
			'إستبدال' => 'استبدال',
			'إشتراك' => 'اشتراك',
			'إستعادة' => 'استعادة',
			'إستقلال' => 'استقلال',
			'إنتقال' => 'انتقال',
			'إتحاد' => 'اتحاد',
			'املاء' => 'إملاء',
			'إستخدام' => 'استخدام',
			'أحدى' => 'إحدى',
			'لاكن' => 'لكن',
			'إثنان' => 'اثنان',
			'إحتياط' => 'احتياط',
			'إقتباس' => 'اقتباس',
			'ادارة' => 'إدارة',
			'ابناء' => 'أبناء',
			'الانصار' => 'الأنصار',
			'اشارة' => 'إشارة',
			'إقرأ' => 'اقرأ',
			'إمتياز' => 'امتياز',
			'ارق' => 'أرق',
			'اللة' => 'الله',
			'إختبار' => 'اختبار',
			'==[ ]?روابط خارجية[ ]?==' => '== وصلات خارجية ==',
			'ارسال' => 'إرسال',
			'إتصالات' => 'اتصالات',
			'ابو' => 'أبو',
			'ابا' => 'أبا',
			'اخو' => 'أخو',
			'اخا' => 'أخا',
			'اخي' => 'أخي',
			'احد' => 'أحد',
			'اربعاء' => 'أربعاء',
			'اول' => 'أول',
			'(ال|)اهم' => '$1أهم',
			'(ال|)اثقل' => '$1أثقل',
			'(ال|)امجد' => '$1أمجد',
			'(ال|)اوسط' => '$1أوسط',
			'(ال|)اشقر' => '$1أشقر',
			'(ال|)انور' => '$1أنور',
			'(ال|)اصعب' => '$1أصعب',
			'(ال|)اسهل' => '$1أسهل',
			'(ال|)اجمل' => '$1أجمل',
			'(ال|)اقبح' => '$1أقبح',
			'(ال|)اطول' => '$1أطول',
			'(ال|)اقصر' => '$1أقصر',
			'(ال|)اسمن' => '$1أسمن',
			'(ال|)اذكى' => '$1أذكى',
			'(ال|)اكثر' => '$1أكثر',
			'(ال|)افضل' => '$1أفضل',
			'(ال|)اكبر' => '$1أكبر',
			'(ال|)اشهر' => '$1أشهر',
			'(ال|)ابطأ' => '$1أبطأ',
			'(ال|)اماني' => '$1أماني',
			'(ال|)احلام' => '$1أحلام',
			'(ال|)اسماء' => '$1أسماء',
			'(ال|)اسامة' => '$1أسامة',
			'ابراهيم' => 'إبراهيم',
			'اسماعيل' => 'إسماعيل',
			'ايوب' => 'أيوب',
			'ايمن' => 'أيمن',
			'اوزبكستان' => 'أوزبكستان',
			'اذربيجان' => 'أذربيجان',
			'افغانستان' => 'أفغانستان',
			'انجلترا' => 'إنجلترا',
			'ايطاليا' => 'إيطاليا',
			'اوربا' => 'أوروبا',
			'أوربا' => 'أوروبا',
			'اوغندة' => 'أوغندة',
			'(ال|)ا(لماني|فريقي|سترالي)(ا|ة|تان|ان|ين|ي|ون|و|ات|)' => '$1أ$2$3',
			'(ال|)ا(وروب|مريك)(ا|ي|ية|يتان|يان|يين|يي|يون|يو|يات|)' => '$1أ$2$3',
			'(ال|)ا(ردن|رجنتين|وغند|سبان|وكران|فغان)(ي|ية|يتان|يان|يين|يي|يون|يو|يات|)' => '$1أ$2$3',
			'(ال|)ا(سرائيل|يران|مارات|نكليز|نجليز)(ي|ية|يتان|يان|يين|يي|يون|يو|يات|)' => '$1إ$2$3',
			'(ال|)(ا|أ)(رثوذكس|رثوذوكس)(ي|ية|يتان|يان|يين|يي|يون|يو|يات|)' => '$1أرثوذكس$4',
			'إست(عمل|خدم|مر|مد|مال|عاض|قام|حال|جاب|قال|زاد|عان|طال)(ت|ا|وا|)' => 'است$1$2',
			'إست(حال|قال|طال|زاد|عان|قام|راح|جاب|عاض|مال)ة' => 'است$1ة',
	 );

	 foreach($words as $k=>$v){
		 $regex_replace['!\b'.$k.'\b!u'] = $v;
	 }

	$new_content = str_replace(array_keys($simple_replace), array_values($simple_replace), $content);
	$new_content = preg_replace(array_keys($regex_replace), array_values($regex_replace), $new_content);


	#https://ar.wikipedia.org/wiki/%D9%88%D9%8A%D9%83%D9%8A%D8%A8%D9%8A%D8%AF%D9%8A%D8%A7:%D8%A7%D9%84%D8%A3%D9%88%D8%AA%D9%88_%D9%88%D9%8A%D9%83%D9%8A_%D8%A8%D8%B1%D8%A7%D9%88%D8%B2%D8%B1/%D8%A7%D9%84%D9%85%D8%B3%D8%AA%D8%A8%D8%AF%D9%84%D8%A7%D8%AA
	PeachyAWBFunctions::fixTypos($new_content);


	if($content == $new_content){
		return null;
	}

	return $new_content;
}



//for testing only
if(isset($_GET['test'])){
	$text = '
ايطاليا
الماني
خالد و سعد
';
	echo grammar($text);
}
